gicking/stm8gal/tools/BSL_activate/stm8as.h
/**
  \file stm8as
   
  \author G. Icking-Konert
  \date 2013-11-22
  \version 0.1
   
  \brief definition of STM8 peripherals etc.
   
  definition of STM8 peripheral registers, interrupt
  vector table, and some useful macros
*/

/*-----------------------------------------------------------------------------
    MODULE DEFINITION FOR MULTIPLE INCLUSION
-----------------------------------------------------------------------------*/
#ifndef _STM8AS_H
#define _STM8AS_H


/*-----------------------------------------------------------------------------
    set device specific peripherals base addresses from datasheet
    (see "hardware register map")
-----------------------------------------------------------------------------*/

// GPIOs
#define ADDR_PA           0x5000
#define ADDR_PB           0x5005
#define ADDR_PC           0x500A
#define ADDR_PD           0x500F
#define ADDR_PE           0x5014
#define ADDR_PF           0x5019
#define ADDR_PG           0x501E
#define ADDR_PH           0x5023
#define ADDR_PI           0x5028

// flash
#define ADDR_FLASH_CR1    0x505A
#define ADDR_FLASH_CR2    0x505B
#define ADDR_FLASH_NCR2   0x505C
#define ADDR_FLASH_FPR    0x505D
#define ADDR_FLASH_NFPR   0x505E
#define ADDR_FLASH_IAPSR  0x505F



/*-----------------------------------------------------------------------------
    COMPILER SPECIFIC SETTINGS
-----------------------------------------------------------------------------*/

#include <stdint.h>

// Cosmic compiler
#if defined(__CSMC__)
  
  /// syntax for variables at absolute addresses
  #define reg(addr,type,name)    extern volatile type name @addr
  
  /// single line inline assembler
  #define ASM(mnem)    _asm(mnem)
  
  /// start multi-line inline assembler
  #define ASM_START    #asm

  /// end multi-line inline assembler
  #define ASM_END      #endasm
  

// SDCC compiler
#elif defined(__SDCC)
  
  /// syntax for variables at absolute addresses
  #define reg(addr,type,name)    volatile __at(addr) type name

  /// single line inline assembler
  #define ASM(mnem)    __asm__(mnem)
  
  /// start multi-line inline assembler
  #define ASM_START    __asm

  /// end multi-line inline assembler
  #define ASM_END      __endasm;


// compiler unknown
#else
  #error in 'stm8.h': compiler not supported
#endif



/*-----------------------------------------------------------------------------
    DEFINITION OF GLOBAL MACROS/#DEFINES
-----------------------------------------------------------------------------*/

/***
 device information
***/

/// name of STM8 device
#define __DEVICE        "stm8af52aa"

/// RAM size in bytes (see datasheet of device)
#define __RAM_SIZE      (6*1024)

/// flash size in bytes (see datasheet of device)
#define __FLASH_SIZE    (128*1024)


/***
 misc macros
***/

/// perform a nop() operation (=minimum delay)
#define _NOP_                ASM("nop")

/// disable interrupt handling
#define DISABLE_INTERRUPTS   ASM("sim")

/// enable interrupt handling
#define ENABLE_INTERRUPTS    ASM("rim")


/***
 macros for bitwise r/w access
***/

/// read single bit from data
#define read_bit(byte, bit)			      (byte & (1 << bit), >> bit)

/// set single bit in data to '1'
#define set_bit(byte, bit)            byte |= (1 << bit)

/// clear single bit in data to '0'
#define clear_bit(byte, bit)		      byte &= ~(1 << bit)

/// set single bit state in data to specified value
#define write_bit(byte, bit, state)		(state?(byte|=(1<<bit)):(byte&=~(1<<bit)))

/// toggle single bit state in data
#define toggle_bit(byte, bit)		      byte ^= (1 << bit)



/***
 STM8 interrupt vector for SDCC (for Cosmic see 'stm8_interrupt_vector.c')
***/
#if defined(__SDCC)
  
  /// irq0 - External Top Level interrupt (TLI)
  #define __TLI_VECTOR__             0
  
  /// irq1 - Auto Wake Up from Halt interrupt
  #define __AWU_VECTOR__             1

  /// irq2 - Clock Controller interrupt
  #define __CLK_VECTOR__             2
  
  /// irq3 - External interrupt 0 (GPIOA)
  #define __EXTI0_VECTOR__           3
  
  /// irq4 - External interrupt 1 (GPIOB)
  #define __EXTI1_VECTOR__           4
  
  /// irq5 - External interrupt 2 (GPIOC)
  #define __EXTI2_VECTOR__           5
  
  /// irq6 - External interrupt 3 (GPIOD)
  #define __EXTI3_VECTOR__           6
  
  /// irq7 - External interrupt 4 (GPIOE)
  #define __EXTI4_VECTOR__           7
  
  /// irq8 - CAN receive interrupt
  #define __CAN_RX_VECTOR__          8
  
  /// irq9 - CAN transmit interrupt
  #define __CAN_TX_VECTOR__          9
  
  /// irq10 - SPI End of transfer interrupt
  #define __SPI_VECTOR__            10
  
  /// irq11 - TIM1 Update/Overflow/Trigger/Break interrupt
  #define __TIM1UPD_VECTOR__        11
  
  /// irq12 - TIM1 Capture/Compare interrupt
  #define __TIM1CAP_VECTOR__        12
  
  /// irq13 - TIM2 Update/Overflow/Break interrupt
  #define __TIM2UPD_VECTOR__        13
  
  /// irq14 - TIM2 Capture/Compare interrupt
  #define __TIM2CAP_VECTOR__        14
  
  /// irq15 - Reserved
  #define __TIM3UPD_VECTOR__        15
  
  /// irq16 - Reserved
  #define __TIM3CAP_VECTOR__        16
  
  /// irq17 - UART1(=LINUART, Tx complete interrupt
  #define __UART1_TX_CMPL_VECTOR__  17
  
  /// irq18 - UART1(=LINUART, Rx interrupt
  #define __UART1_RX_FULL_VECTOR__  18
  
  /// irq19 - I2C interrupt
  #define __I2C_VECTOR__            19
  
  /// irq20 - UART2 Tx interrupt
  #define __UART3_TX_CMPL_VECTOR__  20
  
  /// irq21 - UART2 Rx interrupt
  #define __UART3_RX_FULL_VECTOR__  21
  
  /// irq22 - ADC1 end of conversion/Analog watchdog interrupts
  #define __ADC2_VECTOR__           22
  
  /// irq23 - Timer 4 interrupt
  #define __TIM4UPD_VECTOR__        23
  
  /// irq24 - FLASH interrupt
  #define __FLASH_VECTOR__          24
  
#endif // __SDCC


/*-----------------------------------------------------------------------------
    DECLARATION OF GLOBAL TYPEDEFS
-----------------------------------------------------------------------------*/

/***
 typedefs for comfortable 8- and 16-bit access 
***/

/// union for bit- or bytewise access to 8-bit data
/** union for bitwise or bytewise read/write access to 8-bit data (=byte) */
typedef union {

