gicking/stm8gal/tools/BSL_activate/stm8as.h
  /// for byte access
  uint8_t  byte;
  
  /// for bit access
  struct {
    uint8_t b0 : 1;
    uint8_t b1 : 1;
    uint8_t b2 : 1;
    uint8_t b3 : 1;
    uint8_t b4 : 1;
    uint8_t b5 : 1;
    uint8_t b6 : 1;
    uint8_t b7 : 1;
  } bit;
  
} byte_t;


/// struct for bytewise r/w access to 16bit data
/**
 Note: order of r/w access is important and cannot be guaranteed in C --> don't use union like for byte_t
   - write: HB+LB ok / LB+HB and word fails! \n
   - read: LB+HB and word ok / HB+LB fails! \n
*/
typedef struct {

  /// high byte in 16b word
  uint8_t byteH   : 8;

  /// low byte in 16b word
  uint8_t byteL  : 8;

} word_t;


/*-----------------------------------------------------------------------------
    DEFINITION OF STM8 PERIPHERAL REGISTERS
-----------------------------------------------------------------------------*/

//--------
// GPIOs
//--------

/// port control structure
/** structure for controlling/monitoring pins in GPIO mode */
typedef struct {
  
  /// Port x output data register (Px_ODR)
  byte_t ODR;

  /// Port x pin input register (Px_IDR)
  byte_t IDR;

  /// Port x data direction register (Px_DDR)
  byte_t DDR;

  /// Port x control register 1 (Px_CR1)
  byte_t CR1;

  /// Port x control register 2 (Px_CR2)
  byte_t CR2;

} port_t;

/// registers for GPIO port PA access
reg(ADDR_PA, port_t, PA);

/// registers for GPIO port PB access
reg(ADDR_PB, port_t, PB);

/// registers for GPIO port PC access
reg(ADDR_PC, port_t, PC);

/// registers for GPIO port PD access
reg(ADDR_PD, port_t, PD);

/// registers for GPIO port PE access
reg(ADDR_PE, port_t, PE);

/// registers for GPIO port PF access
reg(ADDR_PF, port_t, PF);

/// registers for GPIO port PG access
reg(ADDR_PG, port_t, PG);

/// registers for GPIO port PH access
reg(ADDR_PH, port_t, PH);

/// registers for GPIO port PI access
reg(ADDR_PI, port_t, PI);


//--------
// Clocks
//--------

/// Internal clock register (CLK_ICKR)
/** union for controlling/monitoring the internal high- and low-speed clocks */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
    
    /// High speed internal RC oscillator enable
    uint8_t HSIEN   : 1;
    
    /// High speed internal oscillator ready flag
    uint8_t HSIRDY  : 1;
    
    /// Fast wakeup from Halt/Active-halt modes enable
    uint8_t FHW     : 1;
    
    /// Low speed internal RC oscillator enable
    uint8_t LSIEN   : 1;
    
    /// Low speed internal oscillator ready flag
    uint8_t LSIRDY  : 1;
    
    /// Regulator power off in Active-halt mode enable
    uint8_t REGAH   : 1;
    
    /// Reserved, must be kept cleared
    uint8_t res     : 2;

  } reg;
  
} CLK_ICKR_t;

/// register for controlling/monitoring the internal high- and low-speed clocks
reg(0x50c0, CLK_ICKR_t, CLK_ICKR);



/// External clock register (CLK_ECKR)
/** union for controlling/monitoring an optional external resonator */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
    
    /// High speed external crystal oscillator enable
    uint8_t HSEEN   : 1;
    
    /// High speed external crystal oscillator ready
    uint8_t HSERDY  : 1;
    
    /// Reserved, must be kept cleared
    uint8_t res     : 6;

  } reg;
  
} CLK_ECKR_t;

/// register for controlling/monitoring an optional external resonator
reg(0x50c1, CLK_ECKR_t, CLK_ECKR);



/// Clock master status register (CLK_CMSR)
/** union to read the currently selected master clock source */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
    
    /// Clock master status bits
    uint8_t CKM     : 8;
    
  } reg;
  
} CLK_CMSR_t;

/// register to read the currently selected master clock source
reg(0x50c3, CLK_CMSR_t, CLK_CMSR);



/// Clock master switch register (CLK_SWR)
/** union to select the master clock source */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// Clock master selection bits
    uint8_t SWI     : 8;
    
  } reg;
  
} CLK_SWR_t;

/// register to select the master clock source
reg(0x50c4, CLK_SWR_t, CLK_SWR);



/// Switch control register (CLK_SWCR)
/** union to trigger clock source switching */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
    
    /// Switch busy flag
    uint8_t SWBSY   : 1;
    
    /// Switch start/stop enable
    uint8_t SWEN    : 1;
    
    /// Clock switch interrupt enable
    uint8_t SWIEN   : 1;
    
    /// Clock switch interrupt flag
    uint8_t SWIF    : 1;
    
    /// Reserved
    uint8_t res     : 4;

  } reg;

} CLK_SWCR_t;

/// register to trigger clock source switching
reg(0x50c5, CLK_SWCR_t, CLK_SWCR);



/// Clock divider register (CLK_CKDIVR)
/** union for selecting clock prescalers */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
    
    /// CPU clock prescaler
    uint8_t CPUDIV  : 3;
    
    /// High speed internal clock prescaler
    uint8_t HSIDIV  : 2;
    
    /// Reserved, must be kept cleared.
    uint8_t res     : 3;

  } reg;

} CLK_CKDIVR_t;

/// register for selecting clock prescalers
reg(0x50c6, CLK_CKDIVR_t, CLK_CKDIVR);



/// Peripheral clock gating register 1 (CLK_PCKENR1)
/** union to en-/disable clocking of peripherals 1/2 */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// clock enable I2C
    uint8_t PCKEN_I2C       : 1;
  
    /// clock enable SPI
    uint8_t PCKEN_SPI       : 1;
  
    /// clock enable UART1
    uint8_t PCKEN_UART1     : 1;
  
    /// clock enable UART2
    uint8_t PCKEN_UART2     : 1;
  
    /// clock enable TIM4/TIM6
    uint8_t PCKEN_TIM4_TIM6 : 1;
  
    /// clock enable TIM4/TIM6
    uint8_t PCKEN_TIM2_TIM5 : 1;
  
    /// clock enable TIM3
    uint8_t PCKEN_TIM3      : 1;
  
    /// clock enable TIM1
    uint8_t PCKEN_TIM1      : 1;
    
