gicking/stm8gal/tools/BSL_activate/stm8as.h
  } reg;
  
} CLK_PCKENR1_t;

/// register to en-/disable clocking of peripherals 1/2
reg(0x50c7, CLK_PCKENR1_t, CLK_PCKENR1);



/// Clock security system register (CLK_CSSR)
/** union to control/monitor clock supervision */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
    
    /// Clock security system enable
    uint8_t CSSEN   : 1;
    
    /// Auxiliary oscillator connected to master clock
    uint8_t AUX     : 1;
    
    /// Clock security system detection interrupt enable
    uint8_t CSSDIE  : 1;
    
    /// Clock security system detection
    uint8_t CSSD    : 1;
    
    /// Reserved, must be kept cleared.
    uint8_t res     : 4;
    
  } reg;
  
} CLK_CSSR_t;

/// register to control/monitor clock supervision
reg(0x50c8, CLK_CSSR_t, CLK_CSSR);



/// Configurable clock output register (CLK_CCOR)
/** union to output an internal clock via GPIO */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// Configurable clock output enable
    uint8_t CCOEN   : 1;
  
    /// Configurable clock output selection.
    uint8_t CCOSEL  : 4;
  
    /// Configurable clock output ready
    uint8_t CCORDY  : 1;
  
    /// Configurable clock output busy
    uint8_t CCOBSY  : 1;
  
    /// Reserved, must be kept cleared.
    uint8_t res     : 1;

  } reg;

} CLK_CCOR_t;

/// register to output an internal clock via GPIO
reg(0x50c9, CLK_CCOR_t, CLK_CCOR);



/// Peripheral clock gating register 2 (CLK_PCKENR2)
/** union for en-/disabling clocking of peripherals 2/2 */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// Reserved
    uint8_t res         : 2;

    /// clock enable AWU
    uint8_t PCKEN_AWU   : 1;

    /// clock enable ADC
    uint8_t PCKEN_ADC   : 1;
  
    /// Reserved
    uint8_t res2        : 3;

    /// clock enable CAN
    uint8_t PCKEN_CAN   : 1;

  } reg;

} CLK_PCKENR2_t;

/// register for en-/disabling clocking of peripherals 2/2
reg(0x50ca, CLK_PCKENR2_t, CLK_PCKENR2);



// CAN clock control (obsolete as of STM8 UM rev 7)
/*
typedef union {
  uint8_t  byte;
  struct {
    uint8_t CANDIV  : 3;
    uint8_t res     : 5;
  } reg;
} CLK_CANCCR_t;
reg(0x50cb, CLK_CANCCR_t, CLK_CANCCR);
*/



/// HSI clock calibration trimming register (CLK_HSITRIMR)
/** union for triming the internal HSI clock */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// HSI trimming value
    uint8_t HSITRIM : 4;
    
    /// Reserved, must be kept cleared.
    uint8_t res     : 4;
    
  } reg;
  
} CLK_HSITRIMR_t;

/// register for triming the internal HSI clock
reg(0x50cc, CLK_HSITRIMR_t, CLK_HSITRIMR);



/// SWIM clock control register (CLK_SWIMCCR)
/** union for reducing SWIM debug interface speed for robustness */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// SWIM clock divider
    uint8_t SWIMCLK : 1;
    
    /// Reserved.
    uint8_t res     : 7;
    
  } reg;
  
} CLK_SWIMCCR_t;

/// register for reducing SWIM debug interface speed for robustness
reg(0x50cd, CLK_SWIMCCR_t, CLK_SWIMCCR);



//--------
// Window Watchdog WWDG
//--------

/// WWDG Control register (WWDG_CR)
/** union for activation of the window watchdog */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// 7-bit WWDG counter (MSB to LSB)
    uint8_t T       : 7;
    
    /// WWDG activation bit (not used if WWDG is enabled by option byte)
    uint8_t WDGA    : 1;
    
  } reg;
  
} WWDG_CR_t;

/// register for activation of the window watchdog
reg(0x50d1, WWDG_CR_t, WWDG_CR);



/// WWDR Window register
/** union for setting the window watchdog period */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// 7-bit window value
    uint8_t W       : 7;
    
    /// Reserved
    uint8_t res     : 1;
    
  } reg;
  
} WWDG_WR_t;

/// register for setting the window watchdog period
reg(0x50d2, WWDG_WR_t, WWDG_WR);



//--------
// independent watchdog (IWDG)
//--------

/// IWDG Key register (IWDG_KR)
/** union for configuring and service the independent timeout watchdog */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// Key value
    uint8_t KEY     : 8;
    
  } reg;
  
} IWDG_KR_t;

/// register for configuring and service the independent timeout watchdog
reg(0x50e0, IWDG_KR_t, IWDG_KR);



/// IWDG Prescaler register (IWDG_PR)
/** union for setting the prescaler for the independent timeout watchdog */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// Prescalerdivider
    uint8_t PR      : 3;
    
    /// Reserved
    uint8_t res     : 5;
    
  } reg;
  
} IWDG_PR_t;

/// register for setting the prescaler for the independent timeout watchdog
reg(0x50e1, IWDG_PR_t, IWDG_PR);



/// IWDG Reload register (IWDG_RLR)
/** union for setting the reload value (=period) of the independent timeout watchdog */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
    
    /// Watchdog counter reload value
    uint8_t RL      : 8;
    
  } reg;
  
} IWDG_RLR_t;

/// register for setting the reload value (=period) of the independent timeout watchdog
reg(0x50e2, IWDG_RLR_t, IWDG_RLR);



//--------
// Flash
//--------

/// Flash control register 1 (FLASH_CR1)
/** union for general flash configuration */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
    
    /// Fixed Byte programming time
    uint8_t FIX     : 1;
    
    /// Flash Interrupt enable
    uint8_t IE      : 1;
    
    /// Power-down in Active-halt mode
    uint8_t AHALT   : 1;
    
    /// Power-down in Halt mode
    uint8_t HALT    : 1;
    
