gicking/stm8gal/tools/BSL_activate/stm8as.h
    /// Reserved
    uint8_t res     : 4;

  } reg;
} FLASH_CR1_t;

/// register for general flash configuration
reg(0x505a, FLASH_CR1_t, FLASH_CR1);



/// Flash control register 2 (FLASH_CR2)
/** union for triggering flash program/erase activity */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
    
    /// Standard block programming
    uint8_t PRG     : 1;
    
    /// Reserved
    uint8_t res     : 3;
    
    /// Fast block programming
    uint8_t FPRG    : 1;
    
    /// Block erasing
    uint8_t ERASE   : 1;
    
    /// Word programming
    uint8_t WPRG    : 1;
    
    /// Write option bytes
    uint8_t OPT     : 1;

  } reg;

} FLASH_CR2_t;

/// register for triggering flash program/erase activity (see also FLASH_CR2)
reg(0x505b, FLASH_CR2_t, FLASH_CR2);

/// complementary register for triggering flash program/erase activity. Write with (FLASH_CR2 ^ 0xFF)
reg(0x505c, FLASH_CR2_t, FLASH_NCR2);




/// Flash protection register (FLASH_FPR)
/** union for setting the size of user boot code area which is especially protected */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// User boot code area protection bits
    uint8_t WPB     : 6;
  
    /// Reserved
    uint8_t res     : 2;

  } reg;

} FLASH_FPR_t;

/// register for setting the size of user boot code area which is especially protected (see also FLASH_NFPR)
reg(0x505d, FLASH_FPR_t, FLASH_FPR);

/// complementary register for setting the size of user boot code area which is especially protected. Write with (FLASH_FPR ^ 0xFF)
reg(0x505e, FLASH_FPR_t, FLASH_NFPR);



/// Flash status register (FLASH_IAPSR)
/** union showing the state of the flash module */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
    
    /// Write attempted to protected page flag
    uint8_t WR_PG_DIS : 1;
    
    /// Flash Program memory unlocked flag
    uint8_t PUL       : 1;
    
    /// End of programming (write or erase operation) flag
    uint8_t EOP       : 1;
    
    /// Data EEPROM area unlocked flag
    uint8_t DUL       : 1;
    
    /// Reserved, forced by hardware to 0
    uint8_t res       : 2;
    
    /// End of high voltage flag
    uint8_t HVOFF     : 1;
    
    /// Reserved
    uint8_t res2      : 1;

  } reg;

} FLASH_IAPSR_t;

/// register showing the state of the flash module
reg(0x505f, FLASH_IAPSR_t, FLASH_IAPSR);



/// Flash program memory unprotecting key register (FLASH_PUKR)
/** union for unlocking program flash for write/erase */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
    
    /// Main program memory unlock keys
    uint8_t PUK     : 8;
    
  } reg;
  
} FLASH_PUKR_t;

/// register for unlocking program flash for write/erase
reg(0x5062, FLASH_PUKR_t, FLASH_PUKR);



/// Data EEPROM unprotection key register (FLASH_DUKR)
/** union for unlocking EEPROM area for write/erase */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// DataEEPROMwriteunlockkeys
    uint8_t DUK     : 8;
    
  } reg;
  
} FLASH_DUKR_t;

/// register for unlocking EEPROM area for write/erase
reg(0x5064, FLASH_DUKR_t, FLASH_DUKR);



//--------
// Auto Wake-Up (AWU)
//--------

/// AWU Control/status register (AWU_CSR)
/** union for controlling/monitoring the Auto Wake-Up (AWU) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
    
    /// LSI measurement enable
    uint8_t MSR     : 1;
    
    /// Reserved
    uint8_t res     : 3;
    
    /// Auto-wakeup enable
    uint8_t AWUEN   : 1;
    
    /// Auto-wakeup flag
    uint8_t AWUF    : 1;
    
    /// Reserved
    uint8_t res2    : 2;

  } reg;

} AWU_CSR_t;

/// register for controlling/monitoring the Auto Wake-Up (AWU)
reg(0x50f0, AWU_CSR_t, AWU_CSR);



/// AWU Asynchronous prescaler register (AWU_APR)
/** union for setting the the AWU clock prescaler divider */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Asynchronous prescaler divider
    uint8_t APR     : 6;
    
    /// Reserved
    uint8_t res     : 2;
    
  } reg;
  
} AWU_APR_t;

/// register for setting the the AWU clock prescaler divider
reg(0x50f1, AWU_APR_t, AWU_APR);



/// AWU Timebase selection register (AWU_TBR)
/** union for setting time intervals between AWU interrupts */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// 
    uint8_t AWUTB   : 4;
  
    /// 
    uint8_t res     : 4;

  } reg;

} AWU_TBR_t;

/// register for setting time intervals between AWU interrupts
reg(0x50f2, AWU_TBR_t, AWU_TBR);



//--------
// Misc
//--------

/// Beeper control/status register (BEEP_CSR)
/** union for beeper control */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Beep clock prescaler divider
    uint8_t BEEPDIV : 5;

    /// Beep enable
    uint8_t BEEPEN  : 1;
    
    /// Beeper frequency selection
    uint8_t BEEPSEL : 2;
    
  } reg;
  
} BEEP_CSR_t;

/// register for beeper control
reg(0x50f3, BEEP_CSR_t, BEEP_CSR);



/// Reset status register (RST_SR)
/** union for reading the source of the last reset event */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Window Watchdog reset flag
    uint8_t WWDGF   : 1;

    /// Independent Watchdog reset flag
    uint8_t IWDGF   : 1;

    /// Illegal opcode reset flag
    uint8_t ILLOPF  : 1;

    /// SWIM reset flag
    uint8_t SWIMF   : 1;

    /// EMC reset flag
    uint8_t EMCF    : 1;

    /// Reserved
    uint8_t res     : 3;

  } reg;

} RST_SR_t;

/// register for reading the source of the last reset event
reg(0x50b3, RST_SR_t, RST_SR);



