gicking/stm8gal/tools/BSL_activate/stm8as.h
/// Global configuration register (CFG_GCR)
/** union for configuration of SWIM pin as GPIO and behavior on return from interrupt (IRET) command */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// SWIM disable
    uint8_t SWD     : 1;
    
    /// Activation level
    uint8_t AL      : 1;
    
    /// Reserved
    uint8_t res     : 6;
    
  } reg;
  
} CFG_GCR_t;

/// register for configuration of SWIM pin as GPIO and behavior on return from interrupt (IRET) instruction
reg(0x7f60, CFG_GCR_t, CFG_GCR);



//--------
// Interrupts
//--------

/// External interrupt control register 1 (EXTI_CR1)
/** union for selecting edge/level for external interrupts via GPIOs (1/2) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// Port A external interrupt sensitivity bits
    uint8_t PAIS    : 2;
  
    /// Port B external interrupt sensitivity bits
    uint8_t PBIS    : 2;
  
    /// Port C external interrupt sensitivity bits
    uint8_t PCIS    : 2;
  
    /// Port D external interrupt sensitivity bits
    uint8_t PDIS    : 2;

  } reg;

} EXTI_CR1_t;

/// register for selecting edge/level for external interrupts via GPIOs (1/2)
reg(0x50a0, EXTI_CR1_t, EXTI_CR1);



/// External interrupt control register 2 (EXTI_CR2)
/** union for selecting edge/level for external interrupts via GPIOs (2/2) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// Port E external interrupt sensitivity bits
    uint8_t PEIS    : 2;
  
    /// Top level interrupt sensitivity
    uint8_t TLIS    : 1;
    
    /// Reserved
    uint8_t res     : 5;

  } reg;

} EXTI_CR2_t;

/// register for selecting edge/level for external interrupts via GPIOs (2/2)
reg(0x50a1, EXTI_CR2_t, EXTI_CR2);



/// Software priority register x (ITC_SPRx)
/** union for prioritization of software interrupts */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// Vector 0,4,8,...28 software priority bits
    uint8_t VECT0SPR : 2;
  
    /// Vector 1,5,9,...29 software priority bits
    uint8_t VECT1SPR : 2;
  
    /// Vector 2,6,10,...26 software priority bits
    uint8_t VECT2SPR : 2;
  
    /// Vector 3,7,11,...27 software priority bits
    uint8_t VECT3SPR : 2;

  } reg;

} ITC_SPR_t;

/// register for prioritization of software interrupts (1/8)
reg(0x7f70, ITC_SPR_t, ITC_SPR1);

/// register for prioritization of software interrupts (2/8)
reg(0x7f71, ITC_SPR_t, ITC_SPR2);

/// register for prioritization of software interrupts (3/8)
reg(0x7f72, ITC_SPR_t, ITC_SPR3);

/// register for prioritization of software interrupts (4/8)
reg(0x7f73, ITC_SPR_t, ITC_SPR4);

/// register for prioritization of software interrupts (5/8)
reg(0x7f74, ITC_SPR_t, ITC_SPR5);

/// register for prioritization of software interrupts (6/8)
reg(0x7f75, ITC_SPR_t, ITC_SPR6);

/// register for prioritization of software interrupts (7/8)
reg(0x7f76, ITC_SPR_t, ITC_SPR7);

/// register for prioritization of software interrupts (8/8); VECT2SPR and VECT3SPR are reserved
reg(0x7f77, ITC_SPR_t, ITC_SPR8);



//--------
// Serial Peripheral Interface (SPI)
//--------

/// SPI control register 1 (SPI_CR1)
/** union for configuring SPI interface (1/2) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
    
    /// Clock phase
    uint8_t CPHA     : 1;
    
    /// Clock polarity
    uint8_t CPOL     : 1;
    
    /// Master/slave selection
    uint8_t MSTR     : 1;
    
    /// Baudrate control
    uint8_t BR       : 3;
    
    /// SPI enable
    uint8_t SPE      : 1;
    
    /// Frame format
    uint8_t LSBFIRST : 1;
    
  } reg;

} SPI_CR1_t;

/// register for configuring SPI interface (1/2) 
reg(0x5200, SPI_CR1_t, SPI_CR1);



/// SPI control register 2 (SPI_CR2)
/** union for configuring SPI interface (2/2) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
    
    /// Internal slave select
    uint8_t SSI     : 1;
    
    /// Software slave management
    uint8_t SSM     : 1;
    
    /// Receive only
    uint8_t RXOnly  : 1;
    
    /// Reserved
    uint8_t res     : 1;
    
    /// Transmit CRC next
    uint8_t CRCNEXT : 1;
    
    /// Hardware CRC calculation enable
    uint8_t CRCEN   : 1;
    
    /// Input/Output enable in bidirectional mode
    uint8_t BDOE    : 1;
    
    /// Bidirectional data mode enable
    uint8_t BDM     : 1;

  } reg;

} SPI_CR2_t;

/// register for configuring SPI interface (2/2) 
reg(0x5201, SPI_CR2_t, SPI_CR2);



/// SPI interrupt control register (SPI_ICR)
/** union for configuring SPI interrupt sources */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// Reserved
    uint8_t res     : 4;
  
    /// Wakeup interrupt enable
    uint8_t WKIE    : 1;
  
    /// Error interrupt enable
    uint8_t ERRIE   : 1;
  
    /// Rx buffer not empty interrupt enable
    uint8_t RXIE    : 1;
  
    /// Tx buffer empty interrupt enable
    uint8_t TXIE    : 1;

  } reg;

} SPI_ICR_t;

/// register for configuring SPI interrupt sources
reg(0x5202, SPI_ICR_t, SPI_ICR);



/// SPI status register (SPI_SR)
/** union for reading the state of the SPI interface */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Receive buffer not empty
    uint8_t RxNE    : 1;

    /// Transmit buffer empty
    uint8_t TXE     : 1;

    /// Reserved
    uint8_t res     : 1;

    /// Wakeup flag
    uint8_t WKUP    : 1;

    /// CRC error flag
    uint8_t CRCERR  : 1;

    /// Mode fault
    uint8_t MODF    : 1;

    /// Overrun flag
    uint8_t OVR     : 1;

    /// Busy flag
    uint8_t BSY     : 1;

