gicking/stm8gal/tools/BSL_activate/stm8as.h
  } reg;

} SPI_SR_t;

/// register for reading the state of the SPI interface
reg(0x5203, SPI_SR_t, SPI_SR);



/// SPI data register (SPI_DR)
/** union containing the SPI data both Rx and Tx */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// Data register
    uint8_t DR      : 8;
    
  } reg;
  
} SPI_DR_t;

/// register containing the SPI data both Rx and Tx
reg(0x5204, SPI_DR_t, SPI_DR);



/// SPI CRC polynomial register (SPI_CRCPR)
/** union for defining polynomial for CRC check */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// CRC polynomial register
    uint8_t CRCPOLY : 8;
    
  } reg;
  
} SPI_CRCPR_t;

/// register for defining polynomial for CRC check
reg(0x5205, SPI_CRCPR_t, SPI_CRCPR);



/// SPI Rx CRC register (SPI_RXCRCR)
/** union containing the computed CRC value of the Rx bytes */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// Rx CRC Register
    uint8_t RxCRC   : 8;
    
  } reg;
  
} SPI_RXCRCR_t;

/// register containing the computed CRC value of the Rx bytes
reg(0x5206, SPI_RXCRCR_t, SPI_RXCRCR);



/// SPI Tx CRC register (SPI_TXCRCR)
/** union containing the computed CRC value of the Tx bytes */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// Tx CRC register
    uint8_t TxCRC   : 8;
    
  } reg;
  
} SPI_TXCRCR_t;

/// register containing the computed CRC value of the Tx bytes
reg(0x5207, SPI_TXCRCR_t, SPI_TXCRCR);



//--------
// I2C Bus Interface (I2C)
//--------

/// I2C Control register 1 (I2C_CR1)
/** union for configuring I2C interface (1/2) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// Peripheral enable
    uint8_t PE        : 1;
  
    /// Reserved
    uint8_t res       : 5;
  
    /// General call enable
    uint8_t ENGC      : 1;
  
    /// Clock stretching disable (Slave mode)
    uint8_t NOSTRETCH : 1;

  } reg;

} I2C_CR1_t;

/// register for configuring I2C interface (1/2)
reg(0x5210, I2C_CR1_t, I2C_CR1);



/// I2C Control register 2 (I2C_CR2)
/** union for configuring I2C interface (2/2) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// Start generation
    uint8_t START     : 1;
  
    /// Stop generation
    uint8_t STOP      : 1;
  
    /// Acknowledge enable
    uint8_t ACK       : 1;
  
    /// Acknowledge position (for data reception)
    uint8_t POS       : 1;
  
    /// Reserved
    uint8_t res       : 3;
  
    /// Software reset
    uint8_t SWRST     : 1;

  } reg;

} I2C_CR2_t;

/// register for configuring I2C interface (2/2)
reg(0x5211, I2C_CR2_t, I2C_CR2);



/// I2C Frequency register (I2C_FREQR)
/** union for setting the I2C speed */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// Peripheral clock frequency
    uint8_t FREQ      : 6;
  
    /// Reserved
    uint8_t res       : 2;

  } reg;

} I2C_FREQR_t;

/// register for setting the I2C speed
reg(0x5212, I2C_FREQR_t, I2C_FREQR);



/// I2C Own address register LSB (I2C_OARL)
/** union for setting the I2C address of the STM8 (low byte) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {
  
    /// Interface address [10] (in 10-bit address mode)
    uint8_t ADD0      : 1;
  
    /// Interface address [7:1]
    uint8_t ADD       : 7;

  } reg;

} I2C_OARL_t;

/// register for setting the I2C address of the STM8 (low byte)
reg(0x5213, I2C_OARL_t, I2C_OARL);



/// I2C own address high
/** union for setting the I2C address of the STM8 (high byte) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Reserved
    uint8_t res       : 1;

    /// Interface address [9:8] (in 10-bit address mode)
    uint8_t ADD       : 2;

    /// Reserved
    uint8_t res2      : 3;

    /// Address mode configuration (must always be written as ‘1’)
    uint8_t ADDCONF   : 1;
    
    /// 7-/10-bit addressing mode (Slave mode)
    uint8_t ADDMODE   : 1;
    
  } reg;
  
} I2C_OARH_t;

/// register for setting the I2C address of the STM8 (high byte)
reg(0x5214, I2C_OARH_t, I2C_OARH);



/// I2C Data register (I2C_DR)
/** union containing the I2C data (both Rx and Tx) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Data register
    uint8_t DR        : 8;
    
  } reg;
  
} I2C_DR_t;

/// register containing the I2C data (both Rx and Tx)
reg(0x5216, I2C_DR_t, I2C_DR);



/// I2C Status register 1 (I2C_SR1)
/** union for reading the I2C bus status (1/3) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Start bit (Mastermode)
    uint8_t SB        : 1;

    /// Address sent (master mode) / matched (slave mode)
    uint8_t ADDR      : 1;

    /// Byte transfer finished
    uint8_t BTF       : 1;

    /// 10-bit header sent (Master mode)
    uint8_t ADD10     : 1;

    /// Stop detection (Slave mode)
    uint8_t STOPF     : 1;

    /// Reserved
    uint8_t res       : 1;

    /// Data register not empty (receivers)
    uint8_t RXNE      : 1;

    /// Data register empty (transmitters)
    uint8_t TXE       : 1;
    
  } reg;
  
} I2C_SR1_t;

/// register for reading the I2C bus status (1/3)
reg(0x5217, I2C_SR1_t, I2C_SR1);



/// I2C Status register 2 (I2C_SR2)
/** union for reading the I2C bus status (2/3) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Bus error
    uint8_t BERR      : 1;

    /// Arbitration lost (master mode)
    uint8_t ARLO      : 1;

    /// Acknowledge failure
    uint8_t AF        : 1;

    /// Overrun/underrun
    uint8_t OVR       : 1;

