gicking/stm8gal/tools/BSL_activate/stm8as.h
    /// Reserved
    uint8_t res       : 1;

    /// Wakeup from Halt
    uint8_t WUFH      : 1;

    /// Reserved
    uint8_t res2      : 2;
    
  } reg;
  
} I2C_SR2_t;

/// register for reading the I2C bus status (2/3)
reg(0x5218, I2C_SR2_t, I2C_SR2);



/// I2C status 3
/** union for reading the I2C bus status (3/3) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Master/Slave
    uint8_t MSL       : 1;

    /// Bus busy
    uint8_t BUSY      : 1;

    /// Transmitter/Receiver
    uint8_t TRA       : 1;

    /// Reserved
    uint8_t res       : 1;

    /// General call header (Slavemode)
    uint8_t GENCALL   : 1;

    /// Reserved
    uint8_t res2      : 2;

    /// (not documented)
    uint8_t DUALF     : 1;
    
  } reg;
  
} I2C_SR3_t;

/// register for reading the I2C bus status (3/3)
reg(0x5219, I2C_SR3_t, I2C_SR3);



/// I2C Interrupt register (I2C_ITR)
/** union for configuring I2C interrupts */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Error interrupt enable
    uint8_t ITERREN   : 1;

    /// Event interrupt enable
    uint8_t ITEVTEN   : 1;

    /// Buffer interrupt enable
    uint8_t ITBUFEN   : 1;

    /// Reserved
    uint8_t res       : 5;
    
  } reg;
  
} I2C_ITR_t;

/// register for configuring I2C interrupts
reg(0x521a, I2C_ITR_t, I2C_ITR);



/// I2C Clock control register low (I2C_CCRL)
/** union for configuring I2C clock (1/2) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Clock control register (Master mode)
    uint8_t CCR       : 8;
    
  } reg;
  
} I2C_CCRL_t;

/// register for configuring I2C clock (1/2)
reg(0x521b, I2C_CCRL_t, I2C_CCRL);



/// I2C Clock control register high (I2C_CCRH)
/** union for configuring I2C clock (2/2) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Clock control register in Fast/Standard mode (Master mode)
    uint8_t CCR       : 4;

    /// Reserved
    uint8_t res       : 2;

    /// Fast mode duty cycle
    uint8_t DUTY      : 1;

    /// I2C master mode selection
    uint8_t FS        : 1;
    
  } reg;
  
} I2C_CCRH_t;

/// register for configuring I2C clock (2/2)
reg(0x521c, I2C_CCRH_t, I2C_CCRH);



/// I2C TRISE register (I2C_TRISER)
/** union for configuring the rise time of the SCL line */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Maximum rise time in Fast/Standard mode (Master mode)
    uint8_t TRISE     : 6;

    /// Reserved
    uint8_t res       : 2;
    
  } reg;
  
} I2C_TRISER_t;

/// register for configuring the rise time of the SCL line
reg(0x521d, I2C_TRISER_t, I2C_TRISER);



// I2C packet error checking (undocumented in STM8 UM rev 9)
/*
typedef union {
  uint8_t  byte;
  struct {
    uint8_t res       : 8;
  } reg;
} I2C_PECR_t;
reg(0x521e, I2C_PECR_t, I2C_PECR);
*/

//xxx

//--------
// Controller Area Network (CAN)
//--------

// CAN Master Control
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t INRQ      : 1;

    /// 
    uint8_t SLEEP     : 1;

    /// 
    uint8_t TXFP      : 1;

    /// 
    uint8_t RFLM      : 1;

    /// 
    uint8_t NART      : 1;

    /// 
    uint8_t AWUM      : 1;

    /// 
    uint8_t ABOM      : 1;

    /// 
    uint8_t TTCM      : 1;
    
  } reg;
  
} CAN_MCR_t;

/// register 
reg(0x5420, CAN_MCR_t, CAN_MCR);



/// CAN Master Status
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t INAK      : 1;

    /// 
    uint8_t SLAK      : 1;

    /// 
    uint8_t ERRI      : 1;

    /// 
    uint8_t WKUI      : 1;

    /// 
    uint8_t TX        : 1;

    /// 
    uint8_t RX        : 1;

    /// 
    uint8_t res       : 2;
    
  } reg;
  
} CAN_MSR_t;

/// register 
reg(0x5421, CAN_MSR_t, CAN_MSR);



/// CAN Transmit Status
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t RQCP0     : 1;

    /// 
    uint8_t RQCP1     : 1;

    /// 
    uint8_t RQCP2     : 1;

    /// 
    uint8_t res       : 1;

    /// 
    uint8_t TXOK0     : 1;

    /// 
    uint8_t TXOK1     : 1;

    /// 
    uint8_t TXOK2     : 1;

    /// 
    uint8_t res2      : 1;
    
  } reg;
  
} CAN_TSR_t;

/// register 
reg(0x5422, CAN_TSR_t, CAN_TSR);



/// CAN Transmit Priority
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t CODE0     : 1;

    /// 
    uint8_t CODE1     : 1;

    /// 
    uint8_t TME0      : 1;

    /// 
    uint8_t TME1      : 1;

    /// 
    uint8_t TME2      : 1;

    /// 
    uint8_t LOW0      : 1;

    /// 
    uint8_t LOW1      : 1;

    /// 
    uint8_t LOW2      : 1;
    
  } reg;
  
} CAN_TPR_t;

/// register 
reg(0x5423, CAN_TPR_t, CAN_TPR);



/// CAN Receive FIFO
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t FMP       : 2;

    /// 
    uint8_t res       : 1;

    /// 
    uint8_t FULL      : 1;

    /// 
    uint8_t FOVR      : 1;

    /// 
    uint8_t RFOM      : 1;

    /// 
    uint8_t res2      : 2;
    
  } reg;
  
} CAN_RFR_t;

/// register 
reg(0x5424, CAN_RFR_t, CAN_RFR);



/// CAN Interrupt Enable
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t TMEIE     : 1;

    /// 
    uint8_t FMPIE     : 1;

    /// 
    uint8_t FFIE      : 1;

    /// 
    uint8_t FOVIE     : 1;

    /// 
    uint8_t res       : 3;

    /// 
    uint8_t WKUIE     : 1;
    
