gicking/stm8gal/tools/BSL_activate/stm8as.h
  } reg;
  
} CAN_IER_t;

/// register 
reg(0x5425, CAN_IER_t, CAN_IER);



/// CAN Diagnosis
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t LBKM      : 1;

    /// 
    uint8_t SILM      : 1;

    /// 
    uint8_t SAMP      : 1;

    /// 
    uint8_t RX        : 1;

    /// 
    uint8_t TXM2E     : 1;

    /// 
    uint8_t res       : 3;
    
  } reg;
  
} CAN_DGR_t;

/// register 
reg(0x5426, CAN_DGR_t, CAN_DGR);



/// CAN Filter Page Select (for below registers)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t PS        : 3;

    /// 
    uint8_t res       : 5;
    
  } reg;
  
} CAN_PSR_t;

/// register 
reg(0x5427, CAN_PSR_t, CAN_PSR);


//---
// CAN register page 0 (Tx Mailbox 0)
//---


/// CAN message control/status register (page 0,1,5)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t TXRQ      : 1;

    /// 
    uint8_t ABRQ      : 1;

    /// 
    uint8_t RQCP      : 1;

    /// 
    uint8_t TXOK      : 1;

    /// 
    uint8_t ALST      : 1;

    /// 
    uint8_t TERR      : 1;

    /// 
    uint8_t res       : 2;
    
  } reg;
  
} CAN_MCSR_t;

/// register 
reg(0x5428, CAN_MCSR_t, CAN_MCSR);



/// CAN mailbox data length control register (page 0,1,5,7)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t DLC       : 4;

    /// 
    uint8_t res       : 3;

    /// 
    uint8_t TGT       : 1;
    
  } reg;
  
} CAN_MDLCR_t;

/// register 
reg(0x5429, CAN_MDLCR_t, CAN_MDLCR);



/// CAN mailbox time stamp register (page 0,1,5,7, 16bit)
reg(0x542A, word_t, CAN_MTSR);



/// CAN mailbox identifier register 1 (page 0,1,5,7)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t ID        : 5;  // STID or EXID
    uint8_t RTR       : 1;

    /// 
    uint8_t IDE       : 1;

    /// 
    uint8_t res       : 1;
    
  } reg;
  
} CAN_MIDR1_t;

/// register 
reg(0x542C, CAN_MIDR1_t, CAN_MIDR1);



/// CAN mailbox identifier register 2 (page 0,1,5,7)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t EXID      : 2;  // EXID[17:16]
    uint8_t ID        : 6;  // STID[5:0] or EXID[23:18]
  } reg;
} CAN_MIDR2_t;

/// register 
reg(0x542D, CAN_MIDR2_t, CAN_MIDR2);



/// CAN mailbox identifier register 3 (page 0,1,5,7)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t EXID      : 8;
    
  } reg;
  
} CAN_MIDR3_t;

/// register 
reg(0x542E, CAN_MIDR3_t, CAN_MIDR3);



/// CAN mailbox identifier register 4 (page 0,1,5,7)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t EXID      : 8;
    
  } reg;
  
} CAN_MIDR4_t;

/// register 
reg(0x542F, CAN_MIDR4_t, CAN_MIDR4);



/// CAN mailbox data register x (x=1..8, (page 0,1,5,7)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t DATA      : 8;
    
  } reg;
  
} CAN_MDAR_t;

/// register 
reg(0x5430, CAN_MDAR_t, CAN_MDAR1);

/// register 
reg(0x5431, CAN_MDAR_t, CAN_MDAR2);

/// register 
reg(0x5432, CAN_MDAR_t, CAN_MDAR3);

/// register 
reg(0x5433, CAN_MDAR_t, CAN_MDAR4);

/// register 
reg(0x5434, CAN_MDAR_t, CAN_MDAR5);

/// register 
reg(0x5435, CAN_MDAR_t, CAN_MDAR6);

/// register 
reg(0x5436, CAN_MDAR_t, CAN_MDAR7);

/// register 
reg(0x5437, CAN_MDAR_t, CAN_MDAR8);


//---
// CAN register page 1 (Tx Mailbox 1)
//---

// CAN_MCSR (0x5428, see page 0
// CAN_MDLCR (0x5429, see page 0
// CAN_MTSRL (0x542A, see page 0
// CAN_MTSRH (0x542B, see page 0
// CAN_MIDR1 (0x542C, see page 0
// CAN_MIDR2 (0x542D, see page 0
// CAN_MIDR3 (0x542E, see page 0
// CAN_MIDR4 (0x542F, see page 0
// CAN_MDAR1 (0x5430, see page 0
// CAN_MDAR2 (0x5431, see page 0
// CAN_MDAR3 (0x5432, see page 0
// CAN_MDAR4 (0x5433, see page 0
// CAN_MDAR5 (0x5434, see page 0
// CAN_MDAR6 (0x5435, see page 0
// CAN_MDAR7 (0x5436, see page 0
// CAN_MDAR8 (0x5437, see page 0


//---
// CAN register page 2 (Acceptance Filter 0:1)
//---


/// CAN acceptance filters FxRn (register page 2)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t MASK    : 8;
    
  } reg;
  
} CAN_FxRn_t;

/// register 
reg(0x5428, CAN_FxRn_t, CAN_F0R1);

/// register 
reg(0x5429, CAN_FxRn_t, CAN_F0R2);

/// register 
reg(0x542A, CAN_FxRn_t, CAN_F0R3);

/// register 
reg(0x542B, CAN_FxRn_t, CAN_F0R4);

/// register 
reg(0x542C, CAN_FxRn_t, CAN_F0R5);

/// register 
reg(0x542D, CAN_FxRn_t, CAN_F0R6);

/// register 
reg(0x542E, CAN_FxRn_t, CAN_F0R7);

/// register 
reg(0x542F, CAN_FxRn_t, CAN_F0R8);

/// register 
reg(0x5430, CAN_FxRn_t, CAN_F1R1);

/// register 
reg(0x5431, CAN_FxRn_t, CAN_F1R2);

/// register 
reg(0x5432, CAN_FxRn_t, CAN_F1R3);

/// register 
reg(0x5433, CAN_FxRn_t, CAN_F1R4);

/// register 
reg(0x5434, CAN_FxRn_t, CAN_F1R5);

/// register 
reg(0x5435, CAN_FxRn_t, CAN_F1R6);

/// register 
reg(0x5436, CAN_FxRn_t, CAN_F1R7);

/// register 
reg(0x5437, CAN_FxRn_t, CAN_F1R8);

	
//---
// CAN register page 3 (Acceptance Filter 2:3)
//---

/// CAN acceptance filters FxRn (register page 3)
reg(0x5428, CAN_FxRn_t, CAN_F2R1);

/// register 
reg(0x5429, CAN_FxRn_t, CAN_F2R2);

/// register 
reg(0x542A, CAN_FxRn_t, CAN_F2R3);

/// register 
reg(0x542B, CAN_FxRn_t, CAN_F2R4);

/// register 
reg(0x542C, CAN_FxRn_t, CAN_F2R5);

