gicking/stm8gal/tools/BSL_activate/stm8as.h
/// register 
reg(0x542D, CAN_FxRn_t, CAN_F2R6);

/// register 
reg(0x542E, CAN_FxRn_t, CAN_F2R7);

/// register 
reg(0x542F, CAN_FxRn_t, CAN_F2R8);

/// register 
reg(0x5430, CAN_FxRn_t, CAN_F3R1);

/// register 
reg(0x5431, CAN_FxRn_t, CAN_F3R2);

/// register 
reg(0x5432, CAN_FxRn_t, CAN_F3R3);

/// register 
reg(0x5433, CAN_FxRn_t, CAN_F3R4);

/// register 
reg(0x5434, CAN_FxRn_t, CAN_F3R5);

/// register 
reg(0x5435, CAN_FxRn_t, CAN_F3R6);

/// register 
reg(0x5436, CAN_FxRn_t, CAN_F3R7);

/// register 
reg(0x5437, CAN_FxRn_t, CAN_F3R8);


//---
// CAN register page 4 (Acceptance Filter 4:5)
//---


/// CAN acceptance filters FxRn (register page 4)
reg(0x5428, CAN_FxRn_t, CAN_F4R1);

/// register 
reg(0x5429, CAN_FxRn_t, CAN_F4R2);

/// register 
reg(0x542A, CAN_FxRn_t, CAN_F4R3);

/// register 
reg(0x542B, CAN_FxRn_t, CAN_F4R4);

/// register 
reg(0x542C, CAN_FxRn_t, CAN_F4R5);

/// register 
reg(0x542D, CAN_FxRn_t, CAN_F4R6);

/// register 
reg(0x542E, CAN_FxRn_t, CAN_F4R7);

/// register 
reg(0x542F, CAN_FxRn_t, CAN_F4R8);

/// register 
reg(0x5430, CAN_FxRn_t, CAN_F5R1);

/// register 
reg(0x5431, CAN_FxRn_t, CAN_F5R2);

/// register 
reg(0x5432, CAN_FxRn_t, CAN_F5R3);

/// register 
reg(0x5433, CAN_FxRn_t, CAN_F5R4);

/// register 
reg(0x5434, CAN_FxRn_t, CAN_F5R5);

/// register 
reg(0x5435, CAN_FxRn_t, CAN_F5R6);

/// register 
reg(0x5436, CAN_FxRn_t, CAN_F5R7);

/// register 
reg(0x5437, CAN_FxRn_t, CAN_F5R8);


//---
// CAN register page 5 (Tx Mailbox 2)
//---

// CAN_MCSR (0x5428, see page 0
// CAN_MDLCR (0x5429, see page 0
// CAN_MTSRL (0x542A, see page 0
// CAN_MTSRH (0x542B, see page 0
// CAN_MIDR1 (0x542C, see page 0
// CAN_MIDR2 (0x542D, see page 0
// CAN_MIDR3 (0x542E, see page 0
// CAN_MIDR4 (0x542F, see page 0
// CAN_MDAR1 (0x5430, see page 0
// CAN_MDAR2 (0x5431, see page 0
// CAN_MDAR3 (0x5432, see page 0
// CAN_MDAR4 (0x5433, see page 0
// CAN_MDAR5 (0x5434, see page 0
// CAN_MDAR6 (0x5435, see page 0
// CAN_MDAR7 (0x5436, see page 0
// CAN_MDAR8 (0x5437, see page 0


//---
// CAN register page 6 (Configuration/Diagnostic)
//---


/// CAN error status register (register page 6)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t EWGF      : 1;

    /// 
    uint8_t EPVF      : 1;

    /// 
    uint8_t BOFF      : 1;

    /// 
    uint8_t res       : 1;

    /// 
    uint8_t LEC       : 3;

    /// 
    uint8_t res2      : 1;
    
  } reg;
  
} CAN_ESR_t;

/// register 
reg(0x5428, CAN_ESR_t, CAN_ESR);



/// CAN error interrupt enable register (register page 6)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t EWGIE     : 1;

    /// 
    uint8_t EPVIE     : 1;

    /// 
    uint8_t BOFIE     : 1;

    /// 
    uint8_t res       : 1;

    /// 
    uint8_t LECIE     : 1;

    /// 
    uint8_t res2      : 2;

    /// 
    uint8_t ERRIE     : 1;
    
  } reg;
  
} CAN_EIER_t;

/// register 
reg(0x5429, CAN_EIER_t, CAN_EIER);



/// CAN transmit error counter register (register page 6)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t TEC       : 8;
    
  } reg;
  
} CAN_TECR_t;

/// register 
reg(0x542C, CAN_TECR_t, CAN_TECR);



/// CAN receive error counter register (register page 6)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t REC       : 8;
    
  } reg;
  
} CAN_RECR_t;

/// register 
reg(0x542D, CAN_RECR_t, CAN_RECR);



/// CAN bit timing register 1 (register page 6)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t BRP       : 6;

    /// 
    uint8_t SJW       : 2;
    
  } reg;
  
} CAN_BTR1_t;

/// register 
reg(0x542E, CAN_BTR1_t, CAN_BTR1);



/// CAN bit timing register 2 (register page 6)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t BS1       : 4;

    /// 
    uint8_t BS2       : 3;

    /// 
    uint8_t res       : 1;
    
  } reg;
  
} CAN_BTR2_t;

/// register 
reg(0x542F, CAN_BTR2_t, CAN_BTR2);



/// CAN filter mode register 1 (register page 6)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t FML0      : 1;

    /// 
    uint8_t FMH0      : 1;

    /// 
    uint8_t FML1      : 1;

    /// 
    uint8_t FMH1      : 1;

    /// 
    uint8_t FML2      : 1;

    /// 
    uint8_t FMH2      : 1;

    /// 
    uint8_t FML3      : 1;

    /// 
    uint8_t FMH3      : 1;
    
  } reg;
  
} CAN_FMR1_t;

/// register 
reg(0x5432, CAN_FMR1_t, CAN_FMR1);



/// CAN filter mode register 2 (register page 6)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t FML4      : 1;

    /// 
    uint8_t FMH4      : 1;

    /// 
    uint8_t FML5      : 1;

    /// 
    uint8_t FMH5      : 1;

    /// 
    uint8_t res       : 4;
    
  } reg;
  
} CAN_FMR2_t;

/// register 
reg(0x5433, CAN_FMR2_t, CAN_FMR2);



/// CAN filter configuration register 1 (register page 6)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t FACT0     : 1;

    /// 
    uint8_t FSC00     : 1;

    /// 
    uint8_t FSC01     : 1;

    /// 
    uint8_t res       : 1;

    /// 
    uint8_t FACT1     : 1;

    /// 
    uint8_t FSC10     : 1;

    /// 
    uint8_t FSC11     : 1;

    /// 
    uint8_t res2      : 1;
    
  } reg;
  
} CAN_FCR1_t;

/// register 
reg(0x5434, CAN_FCR1_t, CAN_FCR1);



