gicking/stm8gal/tools/BSL_activate/stm8as.h
/// CAN filter configuration register 2 (register page 6)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t FACT2     : 1;

    /// 
    uint8_t FSC20     : 1;

    /// 
    uint8_t FSC21     : 1;

    /// 
    uint8_t res       : 1;

    /// 
    uint8_t FACT3     : 1;

    /// 
    uint8_t FSC30     : 1;

    /// 
    uint8_t FSC31     : 1;

    /// 
    uint8_t res2      : 1;
    
  } reg;
  
} CAN_FCR2_t;

/// register 
reg(0x5435, CAN_FCR2_t, CAN_FCR2);



/// CAN filter configuration register 3 (register page 6)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t FACT4     : 1;

    /// 
    uint8_t FSC40     : 1;

    /// 
    uint8_t FSC41     : 1;

    /// 
    uint8_t res       : 1;

    /// 
    uint8_t FACT5     : 1;

    /// 
    uint8_t FSC50     : 1;

    /// 
    uint8_t FSC51     : 1;

    /// 
    uint8_t res2      : 1;
    
  } reg;
  
} CAN_FCR3_t;

/// register 
reg(0x5436, CAN_FCR3_t, CAN_FCR3);


//---
// CAN register page 7 (Receive FIFO)
//---


/// CAN mailbox filter match index register (register page 7)
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t FMI     : 8;
    
  } reg;
  
} CAN_MFMIR_t;

/// register 
reg(0x5428, CAN_MFMIR_t, CAN_MFMIR);


/// CAN_MDLCR (0x5429, see page 0)
// CAN_MTSRL (0x542A, see page 0)
// CAN_MTSRH (0x542B, see page 0)
// CAN_MIDR1 (0x542C, see page 0)
// CAN_MIDR2 (0x542D, see page 0)
// CAN_MIDR3 (0x542E, see page 0)
// CAN_MIDR4 (0x542F, see page 0)
// CAN_MDAR1 (0x5430, see page 0)
// CAN_MDAR2 (0x5431, see page 0)
// CAN_MDAR3 (0x5432, see page 0)
// CAN_MDAR4 (0x5433, see page 0)
// CAN_MDAR5 (0x5434, see page 0)
// CAN_MDAR6 (0x5435, see page 0)
// CAN_MDAR7 (0x5436, see page 0)
// CAN_MDAR8 (0x5437, see page 0)

//xxx

//--------
// LIN Universal asynch. receiver transmitter (LINUART)
//--------

/// UART Status register (UART_SR)
/** union for reading the state of the UART interface */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Parity error
    uint8_t PE      : 1;

    /// Framing error
    uint8_t FE      : 1;

    /// Noise flag
    uint8_t NF      : 1;

    /// LIN Header Error (LIN slave mode) / Overrun error
    uint8_t OR_LHE  : 1;

    /// IDLE line detected
    uint8_t IDLE    : 1;

    /// Read data register not empty
    uint8_t RXNE    : 1;

    /// Transmission complete
    uint8_t TC      : 1;

    /// Transmit data register empty
    uint8_t TXE     : 1;
    
  } reg;
  
} UART_SR_t;

/// register for reading the state of the LINUART interface
reg(0x5240, UART_SR_t, LINUART_SR);



/// UART Data register (UART_DR)
/** union containing UART receive and transmit data */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Data value
    uint8_t DR      : 8;
    
  } reg;
  
} UART_DR_t;

/// register containing LINUART receive and transmit data
reg(0x5241, UART_DR_t, LINUART_DR);



/// UART Baud rate register 1 (UART_BRR1)
/** union for setting the UART baudrate (1/2) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// UART_DIV bits [11:4]
    uint8_t UART_DIV_4_11 : 8;
    
  } reg;
  
} UART_BRR1_t;

/// register for setting the LINUART baudrate (1/2)
reg(0x5242, UART_BRR1_t, LINUART_BRR1);



/// UART Baud rate register 2 (UART_BRR2)
/** union for setting the UART baudrate (2/2) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// UART_DIV bits [3:0]
    uint8_t UART_DIV_0_3   : 4;

    /// UART_DIV bits [15:12]
    uint8_t UART_DIV_12_15 : 4;
    
  } reg;
  
} UART_BRR2_t;

/// register for setting the LINUART baudrate (2/2)
reg(0x5243, UART_BRR2_t, LINUART_BRR2);



/// UART Control register 1 (UART_CR1)
/** union for configuring the UART interface (1/6) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Parity interrupt enable
    uint8_t PIEN    : 1;

    /// Parity selection
    uint8_t PS      : 1;

    /// Parity control enable
    uint8_t PCEN    : 1;

    /// Wakeup method
    uint8_t WAKE    : 1;

    /// word length
    uint8_t M       : 1;

    /// UART Disable (for low power consumption)
    uint8_t UARTD   : 1;

    /// Transmit Data bit 8 (in 9-bit mode)
    uint8_t T8      : 1;

    /// Receive Data bit 8 (in 9-bit mode)
    uint8_t R8      : 1;
    
  } reg;
  
} UART_CR1_t;

/// register for configuring the LINUART interface (1/6)
reg(0x5244, UART_CR1_t, LINUART_CR1);



/// UART Control register 2 (UART_CR2)
/** union for configuring the UART interface (2/6) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Send break
    uint8_t SBK     : 1;

    /// Receiver wakeup
    uint8_t RWU     : 1;

    /// Receiver enable
    uint8_t REN     : 1;

    /// Transmitter enable
    uint8_t TEN     : 1;

    /// IDLE Line interrupt enable
    uint8_t ILIEN   : 1;

    /// Receiver interrupt enable
    uint8_t RIEN    : 1;

    /// Transmission complete interrupt enable
    uint8_t TCIEN   : 1;

    /// Transmitter interrupt enable
    uint8_t TIEN    : 1;
    
  } reg;
  
} UART_CR2_t;

/// register for configuring the LINUART interface (2/6)
reg(0x5245, UART_CR2_t, LINUART_CR2);



/// UART Control register 3 (UART_CR3)
/** union for configuring the UART interface (3/6) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Last bit clock pulse
    uint8_t LBCL    : 1;

