gicking/stm8gal/tools/BSL_activate/stm8as.h
    /// Clock phase
    uint8_t CPHA    : 1;

    /// Clock polarity
    uint8_t CPOL    : 1;

    /// Clock enable
    uint8_t CKEN    : 1;

    /// STOP bits
    uint8_t STOP    : 2;

    /// LIN mode enable
    uint8_t LINEN   : 1;

    /// Reserved, must be kept cleared
    uint8_t res     : 1;
    
  } reg;
  
} UART_CR3_t;

/// register for configuring the LINUART interface (3/6)
reg(0x5246, UART_CR3_t, LINUART_CR3);



/// UART Control register 4 (UART_CR4)
/** union for configuring the UART interface (4/6) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Address of the UART node
    uint8_t ADD     : 4;

    /// LIN Break Detection Flag
    uint8_t LBDF    : 1;

    /// LIN Break Detection Length
    uint8_t LBDL    : 1;

    /// LIN Break Detection Interrupt Enable
    uint8_t LBDIEN  : 1;

    /// Reserved, must be kept cleared
    uint8_t res     : 1;
    
  } reg;
  
} UART_CR4_t;

/// register for configuring the LINUART interface (4/6)
reg(0x5247, UART_CR4_t, LINUART_CR4);



/// UART Control register 5 (UART_CR5)
/** union for configuring the UART interface (5/6) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Reserved, must be kept cleared
    uint8_t res     : 1;

    /// IrDA mode Enable
    uint8_t IREN    : 1;

    /// IrDA Low Power
    uint8_t IRLP    : 1;

    /// Half-Duplex Selection
    uint8_t HDSEL   : 1;

    /// Smartcard NACK enable
    uint8_t NACK    : 1;

    /// Smartcard mode enable
    uint8_t SCEN    : 1;

    /// Reserved, must be kept cleared
    uint8_t res2    : 2;
    
  } reg;
  
} UART_CR5_t;

/// register for configuring the LINUART interface (5/6)
reg(0x5248, UART_CR5_t, LINUART_CR5);



/// LINUART Control register 6 (UART_CR6)
/** union for configuring the LINUART interface (6/6) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// LIN Sync Field
    uint8_t LSF     : 1;

    /// LIN Header Detection Flag
    uint8_t LHDF    : 1;

    /// LIN Header Detection Interrupt Enable
    uint8_t LHDIEN  : 1;

    /// Reserved
    uint8_t res     : 1;

    /// LIN automatic resynchronisation enable
    uint8_t LASE    : 1;

    /// LIN Slave Enable
    uint8_t LSLV    : 1;

    /// Reserved
    uint8_t res2    : 1;

    /// LIN Divider Update Method
    uint8_t LDUM    : 1;
    
  } reg;
  
} UART_CR6_t;

/// register for configuring the LINUART interface (6/6)
reg(0x5249, UART_CR6_t, LINUART_CR6);



/// UART Guard time register (UART_GTR)
/** union for configuring the UART guard time in Smartcard mode */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Guard time value (Smartcard mode)
    uint8_t GT      : 8;
    
  } reg;
  
} UART_GTR_t;

/// register for configuring the LINUART guard time in Smartcard mode
reg(0x524A, UART_GTR_t, LINUART_GTR);



/// UART Prescaler register (UART_PSCR)
/** union containing the clock prescaler for the UART baudrate generator */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Prescaler value
    uint8_t PSR     : 8;
    
  } reg;
  
} UART_PSCR_t;

/// register containing the clock prescaler for the LINUART baudrate generator
reg(0x524B, UART_PSCR_t, LINUART_PSCR);



//--------
// Universal asynch. receiver transmitter (UART)
// use unions of LINUART (are identical except LIN support configuration)
//--------

/// register for reading the state of the UART interface
reg(0x5230, UART_SR_t,   USART_SR);

/// register containing UART receive and transmit data
reg(0x5231, UART_DR_t,   USART_DR);

/// register for setting the UART baudrate (1/2)
reg(0x5232, UART_BRR1_t, USART_BRR1);

/// register for setting the UART baudrate (2/2)
reg(0x5233, UART_BRR2_t, USART_BRR2);

/// register  for configuring the UART interface (1/5)
reg(0x5234, UART_CR1_t,  USART_CR1);

/// register for configuring the UART interface (2/5)
reg(0x5235, UART_CR2_t,  USART_CR2);

/// register for configuring the UART interface (3/5)
reg(0x5236, UART_CR3_t,  USART_CR3);

/// register for configuring the UART interface (4/5)
reg(0x5237, UART_CR4_t,  USART_CR4);

/// register for configuring the UART interface (5/5)
reg(0x5238, UART_CR5_t,  USART_CR5);

/// register for configuring the UART guard time in Smartcard mode
reg(0x5239, UART_GTR_t,  USART_GTR);

/// register containing the clock prescaler for the UART baudrate generator
reg(0x523a, UART_PSCR_t, USART_PSCR);



//--------
// Analog Digital Converter (ADC)
//--------


/// ADC control/status register (ADC_CSR)
/** union for controlling / monitoring the analog-digital-converter */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Channel selection bits
    uint8_t CH      : 4;

    /// Analog watchdog interrupt enable
    uint8_t AWDIE   : 1;

    /// Interrupt enable for EOC
    uint8_t EOCIE   : 1;

    /// Analog Watchdog flag
    uint8_t AWD     : 1;

    /// End of conversion
    uint8_t EOC     : 1;
    
  } reg;
  
} ADC_CSR_t;

/// register for controlling / monitoring the analog-digital-converter
reg(0x5400, ADC_CSR_t, ADC_CSR);



/// ADC Configuration 1
/** union for configuring the analog-digital-converter (1/3) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// A/D Converter on/off
    uint8_t ADON    : 1;

    /// Continuous conversion
    uint8_t CONT    : 1;

    /// Reserved, always read as 0
    uint8_t res     : 2;

    /// Clock prescaler selection
    uint8_t SPSEL   : 3;

    /// Reserved, always read as 0
    uint8_t res2    : 1;
    
  } reg;
  
} ADC_CR1_t;

/// register for configuring the analog-digital-converter (1/3)
reg(0x5401, ADC_CR1_t, ADC_CR1);



