gicking/stm8gal/tools/BSL_activate/stm8as.h
/// ADC Configuration 2
/** union for configuring the analog-digital-converter (2/3) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Reserved, must be kept cleared
    uint8_t res     : 1;

    /// Scan mode enable
    uint8_t SCAN    : 1;

    /// Reserved, must be kept cleared
    uint8_t res2    : 1;

    /// Data alignment
    uint8_t ALIGN   : 1;

    /// External event selection
    uint8_t EXTSEL  : 2;

    /// External trigger enable
    uint8_t EXTTRIG : 1;

    /// Reserved, must be kept cleared
    uint8_t res3    : 1;
    
  } reg;
  
} ADC_CR2_t;

/// register for configuring the analog-digital-converter (2/3)
reg(0x5402, ADC_CR2_t, ADC_CR2);



/// ADC Configuration 3
/** union for configuring the analog-digital-converter (3/3) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Reserved, must be kept cleared
    uint8_t res     : 6;

    /// Overrun flag
    uint8_t OVR     : 1;

    /// Data buffer enable
    uint8_t DBUF    : 1;
    
  } reg;
  
} ADC_CR3_t;

/// register for configuring the analog-digital-converter (3/3)
reg(0x5403, ADC_CR3_t, ADC_CR3);



/// register for 10-bit ADC measurement result
reg(0x5404, word_t, ADC_DR);



/// ADC Schmitt Trigger Disable register
reg(0x5406, word_t, ADC_TDR);



//--------
// 16-Bit Timer TIM1
//--------


/// TIM1 Control register 1 (TIM1_CR1)
/** union for configuring timer TIM1 (1/2) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Counter enable
    uint8_t CEN     : 1;

    /// Update disable
    uint8_t UDIS    : 1;

    /// Update request source
    uint8_t URS     : 1;

    /// One-pulse mode
    uint8_t OPM     : 1;

    /// Direction
    uint8_t DIR     : 1;

    /// Center-aligned mode selection
    uint8_t CMS     : 2;

    /// Auto-reload preload enable
    uint8_t ARPE    : 1;
    
  } reg;
  
} TIM1_CR1_t;

/// register for configuring timer TIM1 (1/2)
reg(0x5250, TIM1_CR1_t, TIM1_CR1);



/// TIM1 Control register 2 (TIM1_CR2)
/** union for configuring timer TIM1 (2/2) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Capture/compare preloaded control
    uint8_t CCPC    : 1;

    /// Reserved, forced by hardware to 0
    uint8_t res     : 1;

    /// Capture/compare control update selection
    uint8_t COMS    : 1;

    /// Reserved, must be kept cleared
    uint8_t res2    : 1;

    /// Master mode selection
    uint8_t MMS     : 3;

    /// Reserved
    uint8_t res3    : 1;
    
  } reg;
  
} TIM1_CR2_t;

/// register for configuring timer TIM1 (2/2)
reg(0x5251, TIM1_CR2_t, TIM1_CR2);



/// Slave mode control register (TIM1_SMCR)
/** union for configuring master/slave mode of timer */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Clock/trigger/slave mode selection
    uint8_t SMS     : 3;

    /// Reserved
    uint8_t res     : 1;

    /// Trigger selection
    uint8_t TS      : 3;

    /// Master/slave mode
    uint8_t MSM     : 1;
    
  } reg;
  
} TIM1_SMCR_t;

/// register for configuring master/slave mode of timer
reg(0x5252, TIM1_SMCR_t, TIM1_SMCR);



/// TIM1 External trigger register (TIM1_ETR)
/** union for configuring external trigger for timer 1 */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// External trigger filter
    uint8_t ETF     : 4;

    /// External trigger prescaler
    uint8_t ETPS    : 2;

    /// External clock enable
    uint8_t ECE     : 1;

    /// External trigger polarity
    uint8_t ETP     : 1;
    
  } reg;
  
} TIM1_ETR_t;

/// register for configuring external trigger for timer 1
reg(0x5253, TIM1_ETR_t, TIM1_ETR);



/// TIM1 Interrupt enable register (TIM1_IER)
/** union for en-/disabling timer 1 interrupts */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Update interrupt enable
    uint8_t UIE     : 1;

    /// Capture/compare 1 interrupt enable
    uint8_t CC1IE   : 1;

    /// Capture/compare 2 interrupt enable
    uint8_t CC2IE   : 1;

    /// Capture/compare 3 interrupt enable
    uint8_t CC3IE   : 1;

    /// Capture/compare 4 interrupt enable
    uint8_t CC4IE   : 1;

    /// Commutation interrupt enable
    uint8_t COMIE   : 1;

    /// Trigger interrupt enable
    uint8_t TIE     : 1;

    /// Break interrupt enable
    uint8_t BIE     : 1;
    
  } reg;
  
} TIM1_IER_t;

/// register for en-/disabling timer 1 interrupts
reg(0x5254, TIM1_IER_t, TIM1_IER);



/// TIM1 Status register 1 (TIM1_SR1)
/** union for reading the state of timer 1 (1/2) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Update interrupt flag
    uint8_t UIF     : 1;

    /// Capture/compare 1 interrupt flag
    uint8_t CC1IF   : 1;

    /// Capture/compare 2 interrupt flag
    uint8_t CC2IF   : 1;

    /// Capture/compare 3 interrupt flag
    uint8_t CC3IF   : 1;

    /// Capture/compare 4 interrupt flag
    uint8_t CC4IF   : 1;

    /// Commutation interrupt flag
    uint8_t COMIF   : 1;

    /// Trigger interrupt flag
    uint8_t TIF     : 1;

    /// Break interrupt flag
    uint8_t BIF     : 1;
    
  } reg;
  
} TIM1_SR1_t;

/// register for reading the state of timer 1 (1/2)
reg(0x5255, TIM1_SR1_t, TIM1_SR1);



/// TIM1 Status register 2 (TIM1_SR2)
/** union for reading the state of timer 1 (2/2) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Reserved, must be kept cleared
    uint8_t res     : 1;

    /// Capture/compare 1 overcapture flag
    uint8_t CC1OF   : 1;

    /// Capture/compare 2 overcapture flag
    uint8_t CC2OF   : 1;

    /// Capture/compare 3 overcapture flag
    uint8_t CC3OF   : 1;

    /// Capture/compare 4 overcapture flag
    uint8_t CC4OF   : 1;

    /// Reserved, must be kept cleared
    uint8_t res2    : 3;
    
