gicking/stm8gal/tools/BSL_activate/stm8as.h
  } reg;
  
} TIM1_SR2_t;

/// register for reading the state of timer 1 (2/2)
reg(0x5256, TIM1_SR2_t, TIM1_SR2);



/// TIM1 Event generation register (TIM1_EGR)
/** union for generating timer 1 event by SW */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Update generation
    uint8_t UG      : 1;

    /// Capture/compare 1 generation
    uint8_t CC1G    : 1;

    /// Capture/compare 2 generation
    uint8_t CC2G    : 1;

    /// Capture/compare 3 generation
    uint8_t CC3G    : 1;

    /// Capture/compare 4 generation
    uint8_t CC4G    : 1;

    /// Capture/compare control update generation
    uint8_t COMG    : 1;

    /// Trigger generation
    uint8_t TG      : 1;

    /// Break generation
    uint8_t BG      : 1;
    
  } reg;
  
} TIM1_EGR_t;

/// register for generating timer 1 event by SW
reg(0x5257, TIM1_EGR_t, TIM1_EGR);



/// TIM1 Capture/compare mode register 1 (TIM1_CCMR1)
/** union for configuring capture compare for timer 1 channel CC1 */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Capture/compare 1 selection
    uint8_t CC1S    : 2;

    /// Output compare 1 fast enable
    uint8_t OC1FE   : 1;

    /// Output compare 1 preload enable
    uint8_t OC1PE   : 1;

    /// Output compare 1 mode
    uint8_t OC1M    : 3;

    /// Output compare 1 clear enable
    uint8_t OC1CE   : 1;
    
  } reg;
  
} TIM1_CCMR1_t;

/// register for configuring capture compare for timer 1 channel CC1
reg(0x5258, TIM1_CCMR1_t, TIM1_CCMR1);



/// TIM1 Capture/compare mode register 2 (TIM1_CCMR2)
/** union for configuring capture compare for timer 1 channel CC2 */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Capture/compare 2 selection
    uint8_t CC2S    : 2;

    /// Output compare 2 fast enable
    uint8_t OC2FE   : 1;

    /// Output compare 2 preload enable
    uint8_t OC2PE   : 1;

    /// Output compare 2 mode
    uint8_t OC2M    : 3;

    /// Output compare 2 clear enable
    uint8_t OC2CE   : 1;
    
  } reg;
  
} TIM1_CCMR2_t;

/// register for configuring capture compare for timer 1 channel CC2
reg(0x5259, TIM1_CCMR2_t, TIM1_CCMR2);



/// TIM1 Capture/compare mode register 3 (TIM1_CCMR3)
/** union for configuring capture compare for timer 1 channel CC3 */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Capture/compare 3 selection
    uint8_t CC3S    : 2;

    /// Output compare 3 fast enable
    uint8_t OC3FE   : 1;

    /// Output compare 3 preload enable
    uint8_t OC3PE   : 1;

    /// Output compare 3 mode
    uint8_t OC3M    : 3;

    /// Output compare 3 clear enable
    uint8_t OC3CE   : 1;
    
  } reg;
  
} TIM1_CCMR3_t;

/// register for configuring capture compare for timer 1 channel CC3
reg(0x525a, TIM1_CCMR3_t, TIM1_CCMR3);



/// TIM1 Capture/compare mode register 4 (TIM1_CCMR4)
/** union for configuring capture compare for timer 1 channel CC4 */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Capture/compare 4 selection
    uint8_t CC4S    : 2;

    /// Output compare 4 fast enable
    uint8_t OC4FE   : 1;

    /// Output compare 4 preload enable
    uint8_t OC4PE   : 1;

    /// Output compare 4 mode
    uint8_t OC4M    : 3;

    /// Output compare 4 clear enable
    uint8_t OC4CE   : 1;
    
  } reg;
  
} TIM1_CCMR4_t;

/// register for configuring capture compare for timer 1 channel CC4
reg(0x525b, TIM1_CCMR4_t, TIM1_CCMR4);



/// TIM1 Capture/compare enable register 1 (TIM1_CCER1)
/** union for enabling and configuring compare outputs and complementary outputs (1/2)  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Capture/compare 1 output enable
    uint8_t CC1E    : 1;

    /// Capture/compare 1 output polarity
    uint8_t CC1P    : 1;

    /// Capture/compare 1 complementary output enable
    uint8_t CC1NE   : 1;

    /// Capture/compare 1 complementary output polarity
    uint8_t CC1NP   : 1;

    /// Capture/compare 2 output enable
    uint8_t CC2E    : 1;

    /// Capture/compare 2 output polarity
    uint8_t CC2P    : 1;

    /// Capture/compare 2 complementary output enable
    uint8_t CC2NE   : 1;

    /// Capture/compare 2 complementary output polarity
    uint8_t CC2NP   : 1;
    
  } reg;
  
} TIM1_CCER1_t;

/// register for enabling and configuring compare outputs and complementary outputs (1/2)
reg(0x525c, TIM1_CCER1_t, TIM1_CCER1);



/// TIM1 Capture/Compare enable 2
/** union for enabling and configuring compare outputs and complementary outputs (2/2) */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Capture/compare 3 output enable
    uint8_t CC3E    : 1;

    /// Capture/compare 3 output polarity
    uint8_t CC3P    : 1;

    /// Capture/compare 3 complementary output enable
    uint8_t CC3NE   : 1;

    /// Capture/compare 3 complementary output polarity
    uint8_t CC3NP   : 1;

    /// Capture/compare 4 output enable
    uint8_t CC4E    : 1;

    /// Capture/compare 4 output polarity
    uint8_t CC4P    : 1;

    /// Reserved
    uint8_t res     : 2;
    
  } reg;
  
} TIM1_CCER2_t;

/// register for enabling and configuring compare outputs and complementary outputs (2/2)
reg(0x525d, TIM1_CCER2_t, TIM1_CCER2);



/// TIM1 Counter high (16 bit)
reg(0x525e, word_t, TIM1_CNTR);



/// TIM1 Prescaler (16 bit)
reg(0x5260, word_t, TIM1_PSCR);



/// TIM1 Auto-reload register (16 bit)
reg(0x5262, word_t, TIM1_ARR);



/// TIM1 Repetition counter
/** union for reducing update rate of timer 1 re-load register */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

