gicking/stm8gal/tools/BSL_activate/stm8as.h
    /// Repetition counter value
    uint8_t REP     : 8;
    
  } reg;
  
} TIM1_RCR_t;

/// register union for reducing update rate of timer 1 re-load register
reg(0x5264, TIM1_RCR_t, TIM1_RCR);



/// TIM1 Capture/Compare 1 register (16 bit)
reg(0x5265, word_t, TIM1_CCR1);



/// TIM1 Capture/Compare 2 register (16 bit)
reg(0x5267, word_t, TIM1_CCR2);



/// TIM1 Capture/Compare 3 register (16 bit)
reg(0x5269, word_t, TIM1_CCR3);



/// TIM1 Capture/Compare 4 register (16 bit)
reg(0x526b, word_t, TIM1_CCR4);



/// TIM1 Break register (TIM1_BKR)
/** union for configuring the timer 1 break input pin */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Lock configuration
    uint8_t LOCK    : 2;

    /// Off state selection for idle mode
    uint8_t OSSI    : 1;

    /// Off state selection for Run mode
    uint8_t OSSR    : 1;

    /// Break enable
    uint8_t BKE     : 1;

    /// Break polarity
    uint8_t BKP     : 1;

    /// Automatic output enable
    uint8_t AOE     : 1;

    /// Main output enable
    uint8_t MOE     : 1;
    
  } reg;
  
} TIM1_BKR_t;

/// register for configuring the timer 1 break input pin
reg(0x526d, TIM1_BKR_t, TIM1_BKR);



/// TIM1 Dead-time
/** union for configuring the compare deadtime between channels and complementary channels */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Deadtime generator set-up
    uint8_t DTG     : 8;
    
  } reg;
  
} TIM1_DTR_t;

/// register for configuring the compare deadtime between channels and complementary channels
reg(0x526e, TIM1_DTR_t, TIM1_DTR);



/// TIM1 Output idle state register (TIM1_OISR)
/** union for setting the timer 1 pin levels in idle mode */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Output idle state 1 (OC1 output)
    uint8_t OIS1    : 1;

    /// Output idle state 1 (OC1N output)
    uint8_t OIS1N   : 1;

    /// Output idle state 2 (OC2 output)
    uint8_t OIS2    : 1;

    /// Output idle state 2 (OC2N output)
    uint8_t OIS2N   : 1;

    /// Output idle state 3 (OC3 output)
    uint8_t OIS3    : 1;

    /// Output idle state 3 (OC3N output)
    uint8_t OIS3N   : 1;

    /// Output idle state 4 (OC4 output)
    uint8_t OIS4    : 1;

    /// Reserved, forced by hardware to 0
    uint8_t res     : 1;
    
  } reg;
  
} TIM1_OISR_t;

/// register for setting the timer 1 pin levels in idle mode
reg(0x526f, TIM1_OISR_t, TIM1_OISR);



//--------
// 16-Bit Timer TIM2
//--------

/// TIMx Control register 1 (TIMx_CR1)
/** union for configuring timer TIM2/TIM3/TIM5 */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Counter enable
    uint8_t CEN     : 1;

    /// Update disable
    uint8_t UDIS    : 1;

    /// Update request source
    uint8_t URS     : 1;

    /// One-pulse mode
    uint8_t OPM     : 1;

    /// Reserved
    uint8_t res     : 3;

    /// Auto-reload preload enable
    uint8_t ARPE    : 1;
    
  } reg;
  
} TIMx_CR1_t;

/// register for configuring timer TIM2
reg(0x5300, TIMx_CR1_t, TIM2_CR1);



/// TIM2 Interrupt enable
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t UIE     : 1;

    /// 
    uint8_t CC1IE   : 1;

    /// 
    uint8_t CC2IE   : 1;

    /// 
    uint8_t CC3IE   : 1;

    /// 
    uint8_t res     : 4;
    
  } reg;
  
} TIM2_IER_t;

/// register 
reg(0x5301, TIM2_IER_t, TIM2_IER);



/// TIM2 Status 1
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t UIF     : 1;

    /// 
    uint8_t CC1IF   : 1;

    /// 
    uint8_t CC2IF   : 1;

    /// 
    uint8_t CC3IF   : 1;

    /// 
    uint8_t res     : 4;
    
  } reg;
  
} TIM2_SR1_t;

/// register 
reg(0x5302, TIM2_SR1_t, TIM2_SR1);



/// TIM2 Status 2
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t res     : 1;

    /// 
    uint8_t CC1OF   : 1;

    /// 
    uint8_t CC2OF   : 1;

    /// 
    uint8_t CC3OF   : 1;

    /// 
    uint8_t res2    : 4;
    
  } reg;
  
} TIM2_SR2_t;

/// register 
reg(0x5303, TIM2_SR2_t, TIM2_SR2);



/// TIM2 Event Generation
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t UG      : 1;

    /// 
    uint8_t CC1G    : 1;

    /// 
    uint8_t CC2G    : 1;

    /// 
    uint8_t CC3G    : 1;

    /// 
    uint8_t res     : 4;
    
  } reg;
  
} TIM2_EGR_t;

/// register 
reg(0x5304, TIM2_EGR_t, TIM2_EGR);



/// TIM2 Capture/Compare mode 1
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t CC1S    : 2;

    /// 
    uint8_t res     : 1;

    /// 
    uint8_t OC1PE   : 1;

    /// 
    uint8_t OC1M    : 3;

    /// 
    uint8_t res2    : 1;
    
  } reg;
  
} TIMx_CCMR1_t;

/// register 
reg(0x5305, TIMx_CCMR1_t, TIM2_CCMR1);



/// TIM2 Capture/Compare mode 2
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t CC2S    : 2;

    /// 
    uint8_t res     : 1;

    /// 
    uint8_t OC2PE   : 1;

    /// 
    uint8_t OC2M    : 3;

    /// 
    uint8_t res2    : 1;
    
  } reg;
  
} TIMx_CCMR2_t;

/// register 
reg(0x5306, TIMx_CCMR2_t, TIM2_CCMR2);



/// TIM2 Capture/Compare mode 3
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t CC3S    : 2;

    /// 
    uint8_t res     : 1;

    /// 
    uint8_t OC3PE   : 1;

    /// 
    uint8_t OC3M    : 3;

    /// 
    uint8_t res2    : 1;
    
