gicking/stm8gal/tools/BSL_activate/stm8as.h
  } reg;
  
} TIM2_CCMR3_t;

/// register 
reg(0x5307, TIM2_CCMR3_t, TIM2_CCMR3);



/// TIM2 Capture/Compare enable 1
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t CC1E    : 1;

    /// 
    uint8_t CC1P    : 1;

    /// 
    uint8_t res     : 2;

    /// 
    uint8_t CC2E    : 1;

    /// 
    uint8_t CC2P    : 1;

    /// 
    uint8_t res2    : 2;
    
  } reg;
  
} TIMx_CCER1_t;

/// register 
reg(0x5308, TIMx_CCER1_t, TIM2_CCER1);



/// TIM2 Capture/Compare enable 2
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t CC3E    : 1;

    /// 
    uint8_t CC3P    : 1;

    /// 
    uint8_t res     : 6;
    
  } reg;
  
} TIM2_CCER2_t;

/// register 
reg(0x5309, TIM2_CCER2_t, TIM2_CCER2);



/// TIM2 Counter (16 bit)
reg(0x530a, word_t, TIM2_CNTR);



/// TIM2 Prescaler
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t PSC     : 4;

    /// 
    uint8_t res     : 4;
    
  } reg;
  
} TIMx_PSCR_t;

/// register 
reg(0x530c, TIMx_PSCR_t, TIM2_PSCR);



/// TIM2 Auto-reload (16 bit)
reg(0x530d, word_t, TIM2_ARR);



/// TIM2 Capture/Compare 1 (16 bit)
reg(0x530f, word_t, TIM2_CCR1);



/// TIM2 Capture/Compare 2 (16 bit)
reg(0x5311, word_t, TIM2_CCR2);



/// TIM2 Capture/Compare 3 (16 bit)
reg(0x5313, word_t, TIM2_CCR3);



//--------
// 16-Bit Timer TIM3
//--------

/// register for configuring timer TIM2
reg(0x5320, TIMx_CR1_t, TIM3_CR1);





/// TIM3 Interrupt enable
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t UIE     : 1;

    /// 
    uint8_t CC1IE   : 1;

    /// 
    uint8_t CC2IE   : 1;

    /// 
    uint8_t res     : 5;
    
  } reg;
  
} TIM3_IER_t;

/// register 
reg(0x5321, TIM3_IER_t, TIM3_IER);



/// TIM3 Status 1
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t UIF     : 1;

    /// 
    uint8_t CC1IF   : 1;

    /// 
    uint8_t CC2IF   : 1;

    /// 
    uint8_t res     : 5;
    
  } reg;
  
} TIM3_SR1_t;

/// register 
reg(0x5322, TIM3_SR1_t, TIM3_SR1);



/// TIM3 Status 2
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t res     : 1;

    /// 
    uint8_t CC1OF   : 1;

    /// 
    uint8_t CC2OF   : 1;

    /// 
    uint8_t res2    : 5;
    
  } reg;
  
} TIM3_SR2_t;

/// register 
reg(0x5323, TIM3_SR2_t, TIM3_SR2);



/// TIM3 Event Generation
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t UG      : 1;

    /// 
    uint8_t CC1G    : 1;

    /// 
    uint8_t CC2G    : 1;

    /// 
    uint8_t res     : 5;
    
  } reg;
  
} TIM3_EGR_t;

/// register 
reg(0x5324, TIM3_EGR_t, TIM3_EGR);



/// TIM3 Capture/Compare mode 1
reg(0x5325, TIMx_CCMR1_t, TIM3_CCMR1);



/// TIM3 Capture/Compare mode 2
reg(0x5326, TIMx_CCMR2_t, TIM3_CCMR2);



/// TIM3 Capture/Compare enable 1
reg(0x5327, TIMx_CCER1_t, TIM3_CCER1);



/// TIM3 Counter (16 bit)
reg(0x5328, word_t, TIM3_CNTR);



/// TIM3 Prescaler
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t PSC     : 4;

    /// 
    uint8_t res     : 4;
    
  } reg;
  
} TIM3_PSCR_t;

/// register 
reg(0x532a, TIM3_PSCR_t, TIM3_PSCR);



/// TIM3 Auto-reload (16 bit)
reg(0x532b, word_t, TIM3_ARR);



/// TIM3 Capture/Compare 1 (16 bit)
reg(0x532d, word_t, TIM3_CCR1);



/// TIM3 Capture/Compare 2 (16 bit)
reg(0x532f, word_t, TIM3_CCR2);



//--------
// 8-Bit Timer TIM4
//--------


/// TIM4 Control 1
reg(0x5340, TIMx_CR1_t, TIM4_CR1);


/// TIM4 Interrupt enable
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t UIE     : 1;

    /// 
    uint8_t res     : 5;

    /// 
    uint8_t TIE     : 1;

    /// 
    uint8_t res2    : 1;
    
  } reg;
  
} TIM4_IER_t;

/// register 
reg(0x5341, TIM4_IER_t, TIM4_IER);



/// TIM4 Status
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t UIF     : 1;

    /// 
    uint8_t res     : 5;

    /// 
    uint8_t TIF     : 1;

    /// 
    uint8_t res2    : 1;
    
  } reg;
  
} TIM4_SR1_t;

/// register 
reg(0x5342, TIM4_SR1_t, TIM4_SR1);



/// TIM4 Event Generation
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t UIF     : 1;

    /// 
    uint8_t res     : 5;

    /// 
    uint8_t TIF     : 1;

    /// 
    uint8_t res2    : 1;
    
  } reg;
  
} TIM4_EGR_t;

/// register 
reg(0x5343, TIM4_EGR_t, TIM4_EGR);



/// TIM4 Counter
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t CNT     : 8;
    
  } reg;
  
} TIM4_CNTR_t;

/// register 
reg(0x5344, TIM4_CNTR_t, TIM4_CNTR);



/// TIM4 Prescaler
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t PSC     : 3;

    /// 
    uint8_t res     : 5;
    
  } reg;
  
} TIM4_PSCR_t;

/// register 
reg(0x5345, TIM4_PSCR_t, TIM4_PSCR);



/// TIM4 Auto-reload
/** union  */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// 
    uint8_t ARR     : 8;
    
  } reg;
  
} TIM4_ARR_t;

/// register 
reg(0x5346, TIM4_ARR_t, TIM4_ARR);


//xxx

//--------
// 16-Bit Timer TIM5
//--------

/// TIM5 Control register 2 (TIM5_CR2)
/** union for configuring timer 5 master mode */
typedef union {
  
  /// bytewise access to register
  uint8_t  byte;
  
  /// bitwise access to register
  struct {

    /// Reserved, must be kept cleared
    uint8_t res      : 4;

    /// Master mode selection
    uint8_t MM       : 3;

    /// Reserved, must be kept cleared
    uint8_t res2     : 1;
    
  } reg;
  
} TIM5_CR2_t;

/// register for configuring timer 5 master mode (address not found)
//reg(xxxx, TIM5_CR2_t, TIM5_CR2);




/*-----------------------------------------------------------------------------
    END OF MODULE DEFINITION FOR MULTIPLE INLUSION
-----------------------------------------------------------------------------*/
#endif // _STM8AS_H
